pluginConfiguration/Loan/Loan/LoanProcess.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<!--
 ~ Copyright (c) 2005-2010, WSO2 Inc. (http://www.wso2.org) All Rights Reserved.
 ~
 ~ WSO2 Inc. licenses this file to you under the Apache License,
 ~ Version 2.0 (the "License"); you may not use this file except
 ~ in compliance with the License.
 ~ You may obtain a copy of the License at
 ~
 ~    http://www.apache.org/licenses/LICENSE-2.0
 ~
 ~ Unless required by applicable law or agreed to in writing,
 ~ software distributed under the License is distributed on an
 ~ "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 ~ KIND, either express or implied.  See the License for the
 ~ specific language governing permissions and limitations
 ~ under the License.
 -->
<definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:bpws="http://docs.oasis-open.org/wsbpel/2.0/varprop" xmlns:ns="http://wso2.org/bps/samples/loan_process/schema" xmlns:ns1="http://wso2.org/bps/samples/LoanService" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://wso2.org/bps/samples/LoanProcess" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" name="LoanProcess" targetNamespace="http://wso2.org/bps/samples/LoanProcess">

    <import location="LoanService.wsdl" namespace="http://wso2.org/bps/samples/LoanService"/>
    <import location="CreditRating.wsdl" namespace="http://wso2.org/bps/samples/CreditRating"/>
    <import location="CustomerInfo.wsdl" namespace="http://wso2.org/bps/samples/CustomerInfo"/>
    <types>
        <xsd:schema targetNamespace="http://wso2.org/bps/samples/LoanProcess">
            <xsd:import namespace="http://wso2.org/bps/samples/loan_process/schema" schemaLocation="loan.xsd"/>
        </xsd:schema>
    </types>
    <message name="laonRequestRequest">
        <part element="ns:LoanRequest" name="part"/>
    </message>
    <message name="laonRequestResponse">
        <part element="ns:LoanOffer" name="part"/>
    </message>
    

    <portType name="LoanProcessPortType">
        <operation name="laonRequest">
            <input message="tns:laonRequestRequest" name="input"/>
            <output message="tns:laonRequestResponse" name="output"/>
        </operation>
    </portType>

    <binding name="LoanProcessBinding" type="tns:LoanProcessPortType">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="laonRequest">
            <soap:operation/>
            <input name="input">
                <soap:body use="literal"/>
            </input>
            <output name="output">
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="LoanProcessService">
        <port binding="tns:LoanProcessBinding" name="LoanProcessPort">
			<soap:address location="http://localhost:8080/ode/processes/LoanProcessService"/>
        </port>
    </service>
    <plnk:partnerLinkType name="LoanProcess">
        <plnk:role name="LoanProcessPortTypeRole" portType="tns:LoanProcessPortType"/>
    </plnk:partnerLinkType>

     <bpws:property name="correlatorProp" type="ns:CustomerIDType"/>

    <bpws:propertyAlias messageType="tns:laonRequestRequest" part="part" propertyName="tns:correlatorProp">
        <bpws:query>/ns:CustomerInfo/ns:CustomerID</bpws:query>
    </bpws:propertyAlias>

    <bpws:propertyAlias messageType="ns1:getLoanOfferResponse" part="part" propertyName="tns:correlatorProp">
        <bpws:query>/ns:CustomerInfo/ns:CustomerID</bpws:query>
    </bpws:propertyAlias>
</definitions>
