项目/ws/cases/LoanProcessService/LoanProcessService_case0.json

{"laonRequest":{"soaps":["<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:q0=\"http://wso2.org/bps/samples/loan_process/schema\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"><soapenv:Body><q0:LoanRequest><q0:CustomerInfo><q0:Name>南方交元债券<\/q0:Name><q0:Email>DUW69P<\/q0:Email><q0:CustomerID>ZF-6148<\/q0:CustomerID><q0:CreditRating>-1<\/q0:CreditRating><\/q0:CustomerInfo><q0:LoanInfo><q0:Amount>-5.0<\/q0:Amount><q0:Years>0<\/q0:Years><\/q0:LoanInfo><\/q0:LoanRequest><\/soapenv:Body><\/soapenv:Envelope>"],"address":"http://localhost:8080/ode/processes/LoanProcessService","soapAction":"http://wso2.org/bps/process/loanprocess/laonRequest"}}
